# Taps
tap "hashicorp/tap"

# Formulae
brew "awscli"
brew "colima"
brew "coredns"
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "ffmpeg"
brew "glab"
brew "go"
brew "graphviz"
brew "hadolint"
brew "harlequin"
brew "jd"
brew "jq"
brew "kubernetes-cli"
brew "mas"
brew "minio"
brew "minio-mc"
brew "mysql"
brew "ncdu"
brew "nvm"
brew "postgresql@16"
brew "tfenv"       # manages terraform versions; don't brew install terraform directly
brew "terragrunt"
brew "wget"
brew "yarn"
brew "yq"
brew "yt-dlp"
brew "zsh-autosuggestions"

# Casks
cask "arc"
cask "aws-vault"
cask "beekeeper-studio"
cask "chatgpt"
cask "codex"
cask "dbeaver-community"
cask "drawio"
cask "figma"
cask "firefox"
cask "flutter"
cask "font-jetbrains-mono"
cask "font-menlo-for-powerline"
cask "google-chrome"
cask "google-drive"
cask "grandperspective"
cask "handbrake"
cask "iterm2"
cask "jetbrains-toolbox"
cask "karabiner-elements"
cask "licecap"
cask "lm-studio"
cask "logseq"
cask "microsoft-office"
cask "microsoft-teams"
cask "miniforge"
cask "musescore"
cask "mysqlworkbench"
cask "obs"
cask "obsidian"
cask "openvpn-connect"
cask "postman"
cask "session-manager-plugin"
cask "slack"
cask "spotify"
cask "telegram"
cask "visual-studio-code"
cask "vlc"
cask "zoom"

# Mac App Store
# mas "App Name", id: 000000000
